#ifndef RES_UI_H
#define RES_UI_H

#define UI_LENGTH 80
#define UI_INFO_TEXT "╔════════════════════════════════════════════════════════════════════════════════════════════════╗\n" \
                     "║>> Выбор входного файла введите: `i<Enter>`                                                     ║\n" \
                     "║   └─ Входной файл:  %-72s   ║ \n" \
                     "║                    ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾  ║\n" \
                     "║>> Выбор выходного файла введите: `o<Enter>` (можно указать несуществующий, он создастся)       ║\n" \
                     "║   ├─ >> Посмотреть файл: `v<Enter>`                                                            ║\n" \
                     "║   └─ Выходной файл:  %-71s   ║ \n" \
                     "║                     ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾  ║\n" \
                     "║>> Для старта введите: `s<Enter>`                                                               ║\n" \
                     "║                                                                                                ║\n" \
                     "║>> Для выхода введите: `exit<Enter>`                                                            ║\n" \
                     "╚════════════════════════════════════════════════════════════════════════════════════════════════╝\n  "

#endif//RES_UI_H
